IDEA StatiCa Open Model
ConcreteCheckResultBase.CheckValue Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 calculated limited value, calculated as strain to limit strain
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double CheckValue { get; set; }
Public Property CheckValue As Double
	Get
	Set
public:
property double CheckValue {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConcreteCheckResultBase Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace